// # Модуль 9. Заняття 8.

//ЗАДАЧА 1
// Перероби функцію на проміс таким чином, щоб проміс повертав значення
// через 2 секунди після виклику функції

// function greet() {
//   return "hello world";
// }

//
// ЗАДАЧА 2
// Використовуй prompt і повертай результат його виклику.
// Створи функцію checkValue(value), в середині якої буде проміс.
// Якщо значення не є числом, відклоняй проміс і логуй "error".
// Якщо значення парне, обробляй проміс і повертай рядок "even" через 1 секунду.
// Якщо значення не парне, обробляй проміс і повертай рядок "odd" через 2 секунди.
//

//
// ЗАДАЧА 3
// Кнопка increment має кожну секунду збільшувати значення на 1
// Кнопка decrement має кожну секунду зменшувати значення на 1.
//Враховуй, що на кнопки можна натиснути нескінченну кількість разів. Зроби так, щоб доки збільшувати/зменшувати запущено, то відповідна кнопка була неактивною (disabled).
//

//
// ЗАДАЧА 4
// Функція startTimer(array) має виводити в консоль кожен елемент масиву 1 раз в секунду.
// Коли черга дійде до останнього елмента масиву, продовжувати виводити логи, але в зворотньому напрямку
// до тих пір поки не дійде до першого елемента, потім зупинити процес.
// const array = [1, 2, 3, 4, 5];
