// # Модуль 5. Заняття 9. Контекст виклику функції та this

// ## Example 1 - Чек з магазину

// Є готова розмітка товарного чеку з магазину. Доповни текстовий вміст параграфу #comment рядком такого формату "Дякуємо, за місяць ви купили {typesQuantity} типів продуктів. Продукт {productName} ви купували {quantity} разів на загальну вартість {price} кредитів."

// ## Example 2 - Галерея

// Створи галерею зображень з масиву об'єктів, додай її в список gallery. Стилізуй.
// const galleryItems = [
//   {
//     preview:
//       "https://cdn.pixabay.com/photo/2019/05/14/22/05/container-4203677__340.jpg",
//     description: "Container Haulage Freight",
//   },
//   {
//     preview:
//       "https://cdn.pixabay.com/photo/2019/05/16/09/47/beach-4206785__340.jpg",
//     description: "Aerial Beach View",
//   },
//   {
//     preview:
//       "https://cdn.pixabay.com/photo/2016/11/18/16/19/flowers-1835619__340.jpg",
//     description: "Flower Blooms",
//   },
// ];

// ## Example 3 - Вивід значення з інпута в alert

//При натисканні на кнопку "Показати" має виводитися значення з інпута в alert. (дивитись в html)

// ## Example 4 - Обмін значеннями

//При натисканні на кнопку "Поміняти" має мінятися значення між інпутами

// ## Example 5 - Скрити пароль

//При натисканні на кнопку "Скрити" значення в інпуті має ховатися під крапками/зірками, а текстовий вміст кнопки мінятися на "Показати". При повторному натисканні текст має бути знову доступним для читання і текст на кнопці прийняти початкове "Скрити".

// ## Example 6 - Random text color
// При клікі на кнопку "Сгенерувати" має створитись рандомна кількість параграфів рандомних кольорів з порядковим номером у його текстовому вмісті. При натисканні на кнопку "Видалити" усі параграфи мають зникати.
// const getRandomNumber = () => Math.floor(Math.random() * 10) + 1;
// const getRandomHexColor=()=> {
//     return `#${Math.floor(Math.random() * 16777215)
//       .toString(16)
//       .padStart(6, 0)}`;
//   }
