// # Модуль 10. Заняття 9

//ЗАДАЧА 1
// Напиши фронтенд частину застосунку для пошуку товарів по слову в назві, описі тощо. Використовуй АРІ
// https://dummyjson.com/
// Взаємодію з бекендом опиши у файлі apiDummyJSON.js
// Зроби фільтрацію параметрів у запиті, тебе цікавлять наступні поля: title, price, description, brand, images, rating.
// Значення для пошуку отримай з форми після натискання на кнопку "Знайти".
// Якщо у відповідь від бекенда прийшло більше 4х продуктів, то додай у інтерфейс розмітку списку, яка буде складатись із зображення і назви продукта. Якщо 2 і менше, то список карток з детальною інформацією по кожному товару.
// Не забудь обробити можливі помилки 😉
//(Product matching these criteria was not found, please try changing your search)
